Tekla Open API Reference for Tekla Structures 2025
Operation.Split Method (SingleRebar, Line)
 Splits the single rebar and creates a new one in the given position.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static SingleRebar Split(
	SingleRebar Object,
	Line SplitLine
)
Public Shared Function Split (
	Object As SingleRebar,
	SplitLine As Line
) As SingleRebar
Parameters
Object
Type: Tekla.Structures.Model.SingleRebar
The single rebar object to be splitted.
SplitLine
Type: Tekla.Structures.Geometry3d.Line
The line where splitting is executed.
Return Value
Type: SingleRebar
The created single rebar on success, null on failure.
See Also
Reference
Operation Class
Split Overload
Tekla.Structures.Model.Operations Namespace